[
    {
        "post_id": "1",
        "title": "Google Interview Experience",
        "author": "XYZ",
        "body": "I am going to share the experience of the first interview of my life. It was with Google, so let's start.\n\nI was quite nervous when I received my first interview call during my first year of college. The opportunity to clear the aptitude and coding rounds for one of the toughest companies was incredibly exciting. It felt like an achievement, especially considering it was my very first interview request from any company.\n\nUpon receiving the email inviting me for an interview, I couldn't help but anticipate the usual polite rejection message. However, I decided to muster the courage to open the email and see what it had to say. To my pleasant surprise, there was a scheduled time for me to confirm my availability for the interview. I promptly selected a date and time and double-checked the time zone difference since it was for a position in Tokyo, Japan.\n\nLiving in a hostel at the time, I shared the interview instructions with my roommates. Given that it was my first interview, I meticulously read through the provided instructions, even though they were quite lengthy and detailed.\n\nThe day of the interview arrived, and I made sure to be prepared well in advance, joining the interview link 15 minutes early. Five minutes before the scheduled time, my interview began precisely on time. The initial questions revolved around coding, and I managed to answer all of them confidently. The interviewers then shifted their focus to Data Structures and Algorithms (DSA), and I was pleased to find that I could answer their questions effectively.\n\nNext, they inquired about my technical knowledge and asked me to share details about my projects. As the interview progressed, they also posed fundamental questions, such as 'Why should we hire you?' This helped me showcase my skills and enthusiasm for the position.\n\nTo my surprise, they veered in a different direction and asked me general knowledge questions. Given that I was from Haridwar, they asked about the tributary of the Ganga River in the city. Further, they inquired about the tributary of the Ganga River in my hometown. These questions caught me off guard, and I struggled to provide satisfactory answers.\n\nHowever, without dwelling on my inability to answer the general knowledge questions, the interviewers swiftly shifted the conversation back to my technical knowledge. In a relatively short time, the interview concluded. Despite my initial nervousness, I found the experience to be enjoyable and enriching.\n\nThe interviewer appreciated my performance and provided valuable suggestions, making the entire process a positive learning experience. Her friendly and supportive demeanor made the interview a memorable and encouraging milestone in my journey."
    },
    {
        "post_id": "2",
        "title": "Uber Interview Experience",
        "author": "XYZ",
        "body": "This year around February, Uber came to my college to hire for an SDE intern role. The Uber team conducted a coding round and asked 3 DSA coding questions, listed below:\n\n- [Burst Balloons](https://leetcode.com/problems/burst-balloons/)\n- [Weighted Random Numbers](https://stackoverflow.com/questions/1761626/weighted-random-numbers)\n- The last one was a bit easy, like finding the maximum sum.\n\nAfter the result was announced and I was selected for an interview process:\n\n**Round 1: DSA**\n\nThe interviewer began by asking me to introduce myself and share insights about his team.\nNext, he asked a question, and the solution initially appeared to be related to binary search. I spent around 30 minutes discussing and considering the binary search approach. However, realizing that I was struggling, the interviewer provided a helpful hint to try solving it using the sliding window technique. I solved it using the hint, and the interviewer was happy with the given solution.\nNext, he asked me something very similar to [Pacific Atlantic Water Flow](https://leetcode.com/problems/pacific-atlantic-water-flow/). I told him my approach, and since we were short of time, I only gave him the pseudo-code.\n\n**Round 2: DSA + CS Fundamental**\n\nIn this round, the interviewer focused on topics such as threads and object-oriented programming (OOP) concepts, engaging me with a series of insightful queries. Additionally, he asked me a medium-level tree question, which was similar to [Maximum Width of Binary Tree](https://leetcode.com/problems/maximum-width-of-binary-tree/) on Leetcode. I have solved this question easily.\nOverall, I felt quite confident about my performance in this round.\n\n**Round 3: HR Round**\n\nDuring this round, the interviewer focused on my current project and asked several questions to gauge my hands-on experience and knowledge. There were numerous cross-questions designed to assess my understanding of the work I had undertaken thoroughly. The interviewer also posed several behavioral questions to gain insights into my approach and mindset. I felt positive about this round as it went exceptionally well for me.\n\nResults were announced, but unfortunately, I had not been selected for the role. Yes, it's true—I faced rejection. It's difficult to put into words the feeling of disappointment and sadness. However, I acknowledge that rejection is an inevitable part of life's journey."
    },
    {
        "post_id": "3",
        "title": "Barclays Interview Experience for BA3",
        "author": "Vivek Kohli",
        "body": "The company came to our campus in mid-August for the role of BA3. One of the most confusing things to clear here is BA3 role **DOES NOT MEAN** 'Business Analyst'; instead, it is just a grade level in Barclays, and the role is of a developer only. Moving on to the process, there were basically 2 rounds:\n\nMCQs + Coding round\nInterview (Tech + HR)\n\nRound 1: MCQs + Coding round\n\nThe test was conducted on HackerEarth. This round is a bit tricky, both in terms of questions as well as time management. There will be 30 MCQs in total and 2 coding questions. The total round was 208 marks of which MCQs had 138 marks and coding had 70 marks and the total time given was 1.5 hours. Yes, you read it right; MCQs had more weightage and that is because they are competitive and not that easy. MCQs range from a variety of topics like:\n\n- C++ / C\n- JavaScript\n- MongoDB\n- Servlets\n- Java\n- Python\n- DBMS (SQL)\n\nThese MCQs were +4 or +6, with just one question for me having -1; otherwise, there is no negative marking. Having intermediate coding knowledge with clear fundamentals is enough to crack enough MCQs.\n\nFor the coding round, the 2 questions were 20 marks and 50 marks. To be honest, both the questions appeared tricky to me at first but only when I started coding and went through it line by line I got the code working. So, please don't give up on the questions based on first look; they are easy, you just need to understand the constraints. I was able to solve the 20 marks question fully and in the 50 marks question, I was able to solve 10/15 test cases.\n\nIn the 20 marks question, I was asked to print the minimum sum of the array using a function as per the given conditions. The condition was to take the next largest or previous largest so here I had to use math. floor and math. ceil inside the function and then I had to replace the numbers in the array any number of times as per this function and get the minimum sum possible.\n\nThe 50 marks question was based on some chemist which has to minimize the cost of the chemical reaction. I didn't have much practice of DP and also not much time was left so I tried brute force (with some optimizations for edge cases) and it worked for 10 test cases and others giving TLE.\n\nThe results came on the next day of the test and 21 people were selected for the next round.\n\nPS: I have observed that it was either easy MCQs with difficult coding questions or vice versa so spend your time properly.\n\nRound 2: Interview (Tech + HR)\n\nTo be very honest I got one of the most enthusiastic interviewers. The interview didn't start with any 'Tell me about yourself' question but it instead started with 'Pick one of your projects and explain it' and this was the best moment as now it was in my hand how to direct the interview. I was very well prepared with my projects and everything that was on my resume. I explained my project which was a crowdsourced emergency resource directory website.\n\nShe asked me questions about how would you manage large data (Note: I knew this question was coming because I had researched about the interviewer well in advance and she was working on the Teradata tool) so I answered with data warehousing and its uses to which she was happy.\n\nThen she asked me 'What are the security measures you have taken to protect your website' to which I answered with some SQL injection preventions and javascript injection prevention techniques which we incorporated in the website.\n\nShe then asked me about my second project and what were the contributions I have made, why was this project made and how did this help. I explained to her in and out about the project which all the technical aspects.\n\nPRO TIP: As I saw she was interested in my projects I asked her whether I can screen share and show the project-related diagrams which I had already made and kept (Like process flow and ER Diagrams). Trust me this is a banger!\n\nThen she moved on to my internships and asked me what I learned from the internships and how did I make an impact on the organization. I explained about technologies I worked on and what I and the organizations gained from the same. As I had worked on docker in my internships she asked me some basic questions about DevOps like, What is DevOps? Why are companies using this? Is it effective?\n\nThe interview ended with some HR questions on the company:\n\nWhat do you know about Barclays?\nWhy Barclays and not other service-based companies?\nThe Interview went very well and it was one of the best interviews I gave!\nThe interview was on Monday and the results came on Tuesday night. There were only 3 students selected and I was not one of them It was mentioned as the 1st list of students but we came to know that it is the final list\n\nDays passed and I lost hope BUT SUDDENLY on Friday morning, the 2nd list came with 4 more students and I was one of them\n\nA total of 7 students were selected from our college.\n\nWHAT SHOULD YOU KNOW?\n\nBe thorough with what you have mentioned in your resume\nknowledge of OOPs\nBasic knowledge about trending technologies like MongoDB\nRISES values (HR questions should be answered based on this) (https://home.barclays/who-we-are/our-strategy/purpose-and-values/)\nResearch about the interviewer on platforms like LinkedIn"
    }
    
]